ESBComponents/MessageValidator/src/test/resources/Scenario44_PDI-2.1b_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://qanhinri2.aegis.net:443/CONNECTGateway/NhinService/NhinPatientDiscovery</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201305UV02:CrossGatewayPatientDiscovery</Action>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:6eb05e27-2ae4-493f-a753-d652fde6c42d</MessageID>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp wsu:Id="_1" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/">
				<wsu:Created>2011-08-12T19:26:20Z</wsu:Created>
				<wsu:Expires>2011-08-12T19:31:20Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion ID="58bbf29a-7285-48d1-bf39-870fbbe59b78" IssueInstant="2011-08-12T19:26:20.484Z" Version="2.0" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema">
				<saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer>
				<saml2:Subject>
					<saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 44 PDI-2.1b</saml2:NameID>
					<saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>q+TQY9/qdV7btrtzP2CESZOHR/bRHxSb4P937bp9r5lyNODbq5raBFA31zZQM4Kv1uwtKSC6u/US4wMeBMN6bGsvSTgu0yyHaeOeHWRLMMWqfS9nEddm/oxOf1pnjOB+Z/R+Ngg5+ajWvkC0aoM7f94HCpCrD7oooy4pkQFVWbs=</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:AuthnStatement AuthnInstant="2011-08-12T19:26:19.906Z" SessionIndex="123456">
					<saml2:SubjectLocality/>
					<saml2:AuthnContext>
						<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
					</saml2:AuthnContext>
				</saml2:AuthnStatement>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">Interop IT Testcase</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.200</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.200</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.200</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue>
							<hl7:Role code="46255001" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Pharmacist" xsi:type="hl7:CE" xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue>
							<hl7:PurposeForUse code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xsi:type="hl7:CE" xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">CAN20000018^^^&amp;2.16.840.1.113883.0.200&amp;ISO</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
				<saml2:AuthzDecisionStatement Decision="Permit" Resource="https://qanhinri2.aegis.net:443/CONNECTGateway/NhinService/NhinPatientDiscovery">
					<saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
					<saml2:Evidence>
						<saml2:Assertion ID="de553a8f-e936-4fd1-ae42-c7d9e024e239" IssueInstant="2011-08-12T19:26:19.906Z" Version="2.0">
							<saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer>
							<saml2:Conditions NotBefore="2011-08-12T19:26:19.906Z" NotOnOrAfter="2011-08-12T19:26:19.906Z"/>
							<saml2:AttributeStatement>
								<saml2:Attribute Name="AccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"/>
								<saml2:Attribute Name="InstanceAccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"/>
							</saml2:AttributeStatement>
						</saml2:Assertion>
					</saml2:Evidence>
				</saml2:AuthzDecisionStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
						<ds:Reference URI="#58bbf29a-7285-48d1-bf39-870fbbe59b78">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
							<ds:DigestValue>nxQiVSV/nm06q+gDE8k+PFXJKCw=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>PWFM7uq5JsUxsd/W6z446AI0ibJm2LCQuG4FAgViLKq3XmkM8aKlee3wRcL0kny4tTqwld/Wj2k5
ydcAVwV5bB8jegUxzxe9vi93G9XiTO4riL2t7kQ8VVmrAcxegSH+jRf3msdzCWacK0jwtjdDbsEW
kCY4jhShcVaY4uaJpjg=</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>q+TQY9/qdV7btrtzP2CESZOHR/bRHxSb4P937bp9r5lyNODbq5raBFA31zZQM4Kv1uwtKSC6u/US
4wMeBMN6bGsvSTgu0yyHaeOeHWRLMMWqfS9nEddm/oxOf1pnjOB+Z/R+Ngg5+ajWvkC0aoM7f94H
CpCrD7oooy4pkQFVWbs=</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
			</saml2:Assertion>
			<ds:Signature Id="_2" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces PrefixList="wsse S"/>
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces PrefixList="wsu wsse S"/>
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>+Mfvn+oE1/2MD+L9rE70t8/XMUk=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>SppE4OLcvwzqNijnRwPF8PCIhZCvvXTaF9PpwZVQXpVbP5qgzc5v6nEPCze3dJarjjVvi7X5dNLDURCvETQQW+Stu9jyvH/ieXTpnGfeYi5L1lPBzDw/uQXygaAtGyYiR0pCMsIpmkBpoQEY5zOHja0Yf2zBz3UJKgLkuQZtWLs=</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">58bbf29a-7285-48d1-bf39-870fbbe59b78</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<PRPA_IN201305UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3" xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns4="urn:gov:hhs:fha:nhinc:common:patientcorrelationfacade">
			<id extension="-5a3e95b1:11d1fa33d45:-7f9b" root="2.16.840.1.113883.0.200"/>
			<creationTime value="20110812152619"/>
			<interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/>
			<processingCode code="T"/>
			<processingModeCode code="T"/>
			<acceptAckCode code="AL"/>
			<receiver typeCode="RCV">
				<device determinerCode="INSTANCE" classCode="">
					<id root="1.2.345.678.999"/>
					<asAgent classCode="AGNT">
						<representedOrganization determinerCode="INSTANCE" classCode="ORG">
							<id root="2.16.840.1.113883.0.102"/>
						</representedOrganization>
					</asAgent>
				</device>
			</receiver>
			<sender typeCode="SND">
				<device determinerCode="INSTANCE" classCode="DEV">
					<id root="2.16.840.1.113883.0.200"/>
					<asAgent classCode="AGENT">
						<representedOrganization determinerCode="INSTANCE" classCode="ORG">
							<id root="2.16.840.1.113883.0.200"/>
						</representedOrganization>
					</asAgent>
				</device>
			</sender>
			<controlActProcess moodCode="EVN" classCode="CACT">
				<code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201305UV02"/>
				<authorOrPerformer typeCode="AUT">
					<assignedDevice classCode="">
						<id root="2.16.840.1.113883.0.200"/>
					</assignedDevice>
				</authorOrPerformer>
				<queryByParameter>
					<queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.200"/>
					<statusCode code="new"/>
					<responseModalityCode code="R"/>
					<responsePriorityCode code="I"/>
					<parameterList>
						<livingSubjectAdministrativeGender>
							<value code="M"/>
							<semanticsText representation="TXT"/>
						</livingSubjectAdministrativeGender>
						<livingSubjectBirthTime>
							<value value="19570423"/>
							<semanticsText representation="TXT"/>
						</livingSubjectBirthTime>
						<livingSubjectId>
							<value extension="CAN20000018" root="2.16.840.1.113883.0.200"/>
							<semanticsText representation="TXT"/>
						</livingSubjectId>
						<livingSubjectId>
							<value extension="" root="2.16.840.1.113883.4.1"/>
							<semanticsText representation="TXT"/>
						</livingSubjectId>
						<livingSubjectName>
							<value>
								<family partType="FAM">Smith</family>
								<given partType="GIV">John</given>
							</value>
							<semanticsText representation="TXT"/>
						</livingSubjectName>
						<patientAddress>
							<value>
								<streetAddressLine>102 Drink Cup Drive</streetAddressLine>
								<city>Kansas City</city>
								<state>MO</state>
								<postalCode>64116</postalCode>
							</value>
						</patientAddress>
					</parameterList>
				</queryByParameter>
			</controlActProcess>
		</PRPA_IN201305UV02>
	</S:Body>
</S:Envelope>
